In [1]:
'''
 data from http://grouplens.org/datasets/movielens/ 
 ml-1m 
'''

'\n data from http://grouplens.org/datasets/movielens/ \n ml-1m \n'

In [2]:
from pandas import DataFrame,Series
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
!ls ml-1m

README      movies.dat  ratings.dat users.dat

In [4]:
# MovieID::Title::Genres
!head -n 5 ml-1m/movies.dat

1::Toy Story (1995)::Animation|Children's|Comedy
2::Jumanji (1995)::Adventure|Children's|Fantasy
3::Grumpier Old Men (1995)::Comedy|Romance
4::Waiting to Exhale (1995)::Comedy|Drama
5::Father of the Bride Part II (1995)::Comedy

In [5]:
# UserID::MovieID::Rating::Timestamp
!head -n 5 ml-1m/ratings.dat

1::1193::5::978300760
1::661::3::978302109
1::914::3::978301968
1::3408::4::978300275
1::2355::5::978824291

In [6]:
# UserID::Gender::Age::Occupation::Zip-code
!head -n 5 ml-1m/users.dat

1::F::1::10::48067
2::M::56::16::70072
3::M::25::15::55117
4::M::45::7::02460
5::M::25::20::55455

In [7]:
!open ml-1m/README

In [8]:
# MovieID::Title::Genres
names = ['MovieID','Title','Genres']
dmoive = pd.read_table('ml-1m/movies.dat',sep='::',header=None,names=names,engine='python')
dmoive.head(3)

   MovieID                    Title                        Genres
0        1         Toy Story (1995)   Animation|Children's|Comedy
1        2           Jumanji (1995)  Adventure|Children's|Fantasy
2        3  Grumpier Old Men (1995)                Comedy|Romance

In [9]:
# UserID::MovieID::Rating::Timestamp
names = ['UserID','MovieID','Rating','Timestamp']
dratings = pd.read_table('ml-1m/ratings.dat',sep='::',header=None,names=names,engine='python')
dratings.head(3)

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968

In [10]:
# UserID::Gender::Age::Occupation::Zip-code
names = ['UserID','Gender','Age','Occupation','Zip-code']
dusers = pd.read_table('ml-1m/users.dat',sep='::',header=None,names=names,engine='python')
dusers.head(3)

   UserID Gender  Age  Occupation Zip-code
0       1      F    1          10    48067
1       2      M   56          16    70072
2       3      M   25          15    55117

In [11]:
data = pd.merge(pd.merge(dmoive,dratings),dusers)
data.head(5)

,MovieID,Title,Genres,UserID,Rating,Timestamp,Gender,Age,Occupation,Zip-code
0,1,Toy Story (1995),Animation|Children's|Comedy,1,5,978824268,F,1,10,48067
1,48,Pocahontas (1995),Animation|Children's|Musical|Romance,1,5,978824351,F,1,10,48067
2,150,Apollo 13 (1995),Drama,1,5,978301777,F,1,10,48067
3,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Fantasy|Sci-Fi,1,4,978300760,F,1,10,48067
4,527,Schindler's List (1993),Drama|War,1,5,978824195,F,1,10,48067

In [12]:
data[data.UserID == 1].head(5)

,MovieID,Title,Genres,UserID,Rating,Timestamp,Gender,Age,Occupation,Zip-code
0,1,Toy Story (1995),Animation|Children's|Comedy,1,5,978824268,F,1,10,48067
1,48,Pocahontas (1995),Animation|Children's|Musical|Romance,1,5,978824351,F,1,10,48067
2,150,Apollo 13 (1995),Drama,1,5,978301777,F,1,10,48067
3,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Fantasy|Sci-Fi,1,4,978300760,F,1,10,48067
4,527,Schindler's List (1993),Drama|War,1,5,978824195,F,1,10,48067

In [13]:
data.columns

Index(['MovieID', 'Title', 'Genres', 'UserID', 'Rating', 'Timestamp', 'Gender',
       'Age', 'Occupation', 'Zip-code'],
      dtype='object')

In [14]:
rating_by_gender = data.pivot_table(values='Rating',index='Title',columns='Gender',aggfunc='mean')
rating_by_gender.head(5)

Gender                                F         M
Title
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

In [15]:
rating_by_gender['diff'] = rating_by_gender.F - rating_by_gender.M
rating_by_gender.head(5)

Gender                                F         M      diff
Title
$1,000,000 Duck (1971)         3.375000  2.761905  0.613095
'Night Mother (1986)           3.388889  3.352941  0.035948
'Til There Was You (1997)      2.675676  2.733333 -0.057658
'burbs, The (1989)             2.793478  2.962085 -0.168607
...And Justice for All (1979)  3.828571  3.689024  0.139547

In [16]:
rating_by_title = data.groupby('Title').size()
rating_by_title.head(5)

Title
$1,000,000 Duck (1971)            37
'Night Mother (1986)              70
'Til There Was You (1997)         52
'burbs, The (1989)               303
...And Justice for All (1979)    199
dtype: int64

In [17]:
rating_by_title.sort_values(ascending=False).head(5)

Title
American Beauty (1999)                                   3428
Star Wars: Episode IV - A New Hope (1977)                2991
Star Wars: Episode V - The Empire Strikes Back (1980)    2990
Star Wars: Episode VI - Return of the Jedi (1983)        2883
Jurassic Park (1993)                                     2672
dtype: int64

In [18]:
mean_rating = data.pivot_table(values='Rating',index='Title',aggfunc='mean')
mean_rating.head(5)

Title
$1,000,000 Duck (1971)           3.027027
'Night Mother (1986)             3.371429
'Til There Was You (1997)        2.692308
'burbs, The (1989)               2.910891
...And Justice for All (1979)    3.713568
Name: Rating, dtype: float64

In [19]:
top_20_rating = mean_rating.sort_values(ascending=False).head(20)
top_20_rating

Title
Gate of Heavenly Peace, The (1995)                                     5.000000
Lured (1947)                                                           5.000000
Ulysses (Ulisse) (1954)                                                5.000000
Smashing Time (1967)                                                   5.000000
Follow the Bitch (1998)                                                5.000000
Song of Freedom (1936)                                                 5.000000
Bittersweet Motel (2000)                                               5.000000
Baby, The (1973)                                                       5.000000
One Little Indian (1973)                                               5.000000
Schlafes Bruder (Brother of Sleep) (1995)                              5.000000
I Am Cuba (Soy Cuba/Ya Kuba) (1964)                                    4.800000
Lamerica (1994)                                                        4.750000
Apple, The (Sib) (1998)                                                4.666667
Sanjuro (1962)                                                         4.608696
Seven Samurai (The Magnificent Seven) (Shichinin no samurai) (1954)    4.560510
Shawshank Redemption, The (1994)                                       4.554558
Godfather, The (1972)                                                  4.524966
Close Shave, A (1995)                                                  4.520548
Usual Suspects, The (1995)                                             4.517106
Schindler's List (1993)                                                4.510417
Name: Rating, dtype: float64

In [20]:
rating_by_title[top_20_rating.index]

Title
Gate of Heavenly Peace, The (1995)                                        3
Lured (1947)                                                              1
Ulysses (Ulisse) (1954)                                                   1
Smashing Time (1967)                                                      2
Follow the Bitch (1998)                                                   1
Song of Freedom (1936)                                                    1
Bittersweet Motel (2000)                                                  1
Baby, The (1973)                                                          1
One Little Indian (1973)                                                  1
Schlafes Bruder (Brother of Sleep) (1995)                                 1
I Am Cuba (Soy Cuba/Ya Kuba) (1964)                                       5
Lamerica (1994)                                                           8
Apple, The (Sib) (1998)                                                   9
Sanjuro (1962)                                                           69
Seven Samurai (The Magnificent Seven) (Shichinin no samurai) (1954)     628
Shawshank Redemption, The (1994)                                       2227
Godfather, The (1972)                                                  2223
Close Shave, A (1995)                                                   657
Usual Suspects, The (1995)                                             1783
Schindler's List (1993)                                                2304
dtype: int64

In [21]:
len(data.Title)

1000209

In [22]:
hot_moives = rating_by_title[rating_by_title > 1000]
print(len(hot_moives))
hot_moives.head(5)

207

Title
2001: A Space Odyssey (1968)    1716
Abyss, The (1989)               1715
African Queen, The (1951)       1057
Air Force One (1997)            1076
Airplane! (1980)                1731
dtype: int64

In [23]:
hot_moives_rating = mean_rating[hot_moives.index]
hot_moives_rating.head(5)

Title
2001: A Space Odyssey (1968)    4.068765
Abyss, The (1989)               3.683965
African Queen, The (1951)       4.251656
Air Force One (1997)            3.588290
Airplane! (1980)                3.971115
Name: Rating, dtype: float64

In [24]:
hot_10_moives = hot_moives_rating.sort_values(ascending=False).head(10)
hot_10_moives

Title
Shawshank Redemption, The (1994)                                               4.554558
Godfather, The (1972)                                                          4.524966
Usual Suspects, The (1995)                                                     4.517106
Schindler's List (1993)                                                        4.510417
Raiders of the Lost Ark (1981)                                                 4.477725
Rear Window (1954)                                                             4.476190
Star Wars: Episode IV - A New Hope (1977)                                      4.453694
Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1963)    4.449890
Casablanca (1942)                                                              4.412822
Sixth Sense, The (1999)                                                        4.406263
Name: Rating, dtype: float64

In [25]:
sdata = {'a':'zhangsan','b':10,'c':'beijing'}
pd.Series(sdata)

a    zhangsan
b          10
c     beijing
dtype: object

In [26]:
a = pd.Series(np.arange(5),index=list('abcdf'))
a

a    0
b    1
c    2
d    3
f    4
dtype: int64

In [27]:
a[:4]

a    0
b    1
c    2
d    3
dtype: int64

In [28]:
a[1:3]

b    1
c    2
dtype: int64

In [29]:
np.sin(a[1:3])

b    0.841471
c    0.909297
dtype: float64

In [30]:
s = a[1:3]
print(s.get('d'))
print(s.get('e',-1))

None
-1

In [31]:
d = {'one':Series(np.arange(3),index=list('abc')),
    'two':Series(np.arange(3),index=list('cbf')),}
data = DataFrame(d)
data

   one  two
a    0  NaN
b    1    1
c    2    0
f  NaN    2

In [32]:
df = DataFrame(d,columns=['one','two'])
df

   one  two
a    0  NaN
b    1    1
c    2    0
f  NaN    2